blog/lum.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://blog.0xhenrique.org/rss.xml"
      title="RSS feed for https://blog.0xhenrique.org/">
<title>Lum - Linux Ubiquitous Marker</title>
<meta name="author" content="Henrique Marques">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status"><ul class="menu-list"><li class="menu-item"><a href="https://blog.0xhenrique.org/">λ 0xhenrique</a></li><li class="menu-item"><a href="https://blog.0xhenrique.org/tag-projects.html">Projects</a></li><li class="menu-item"><a href="https://blog.0xhenrique.org/archive.html">Archive</a></li><li class="menu-item"><a href="https://blog.0xhenrique.org/rss.xml">RSS</a></li><li class="menu-item" style="float:right"><a href="https://blog.0xhenrique.org/about.html">About</a></li></ul></div>
<div id="content">
<div class="post-date">17 Aug 2024</div><h1 class="post-title"><a href="https://blog.0xhenrique.org/lum.html">Lum - Linux Ubiquitous Marker</a></h1>
<p>
Link: <a href="https://github.com/0xhenrique/lum">https://github.com/0xhenrique/lum</a>
</p>

<p>
Lum is a project I started as a way to escape the feeling of being tied to the web-browser when it comes to bookmarks.
The objective is relatively simple, to have access to my bookmarks outside of the browser. This way I could call my bookmarks from anywhere on the computer, whether from Vim, Emacs, the browser itself, the window manager or wherever.
I'm still not sure if I'm going to turn this project into a CLI tool or a library. I still need to try to integrate Lum with some other tool and evaluate which points I failed, which ones I need to improve and where I got things right.
</p>

<p>
I started using the Rust language, but I realized that I wasn't familiar enough with the language to do this. So I left Rust aside for a while and took advantage of the situation to rewrite Lum using Clojure, since I had been planning to put it into practice for a while.
</p>

<p>
This was my first more "serious" project using Clojure, so a lot of things are out of place, a lot of rough edges, a lot of design mistakes, etc.
For example, I'm using JSON to save the bookmarks, but to be honest I don't know if I'll keep this format until the end.
I'm still evaluating whether this would be the most practical and quickest way, considering that I already accumulated more than 12 thousand bookmarks at the height of my NEET time.
I don't think parsing 12 thousand objects in JSON is efficient, but it's something I still need to test in practice.
But at least it helped me get better grasp of a Lisp language. I still intend to revisit this project sometime in the future, maybe even restructure it from scratch to fix the mistakes I made.
For now, I don't think it can replace browser bookmarks, but it's something I'll focus on more in my next iteration with Lum.
</p>

<div id="outline-container-org931a281" class="outline-2">
<h2 id="org931a281">Running Lum</h2>
<div class="outline-text-2" id="text-org931a281">
<p>
Although it is not really necessary to run this program, having fzf and xclip would be great if you want to integrate with other programs. A pretty useful command to fetch your bookmarks would be:
</p>
<div class="org-src-container">
<pre class="src src-bash">$ lum -l | fzf | xclip -selection clipboard
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0c1ae1" class="outline-2">
<h2 id="orgf0c1ae1">Integration with Emacs</h2>
<div class="outline-text-2" id="text-orgf0c1ae1">
<p>
While I'm not deploying binary packages to Lum, I can check my bookmarks through Emacs with a very simple function:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun pache/my-consult-bookmark ()
  "Select a bookmark using `completing-read` and copy it to the clipboard."
  (interactive)
  (let* ((candidates (split-string (shell-command-to-string "java -jar ~/path/to/lum-1.0.0-SNAPSHOT-standalone.jar -l") "\n" t))
         (selection (completing-read "Select bookmark: " candidates)))
    (when selection
      (kill-new selection)
      (message "Copied to clipboard: %s" selection))))
(global-set-key (kbd "C-c b") 'pache/my-consult-bookmark)
</pre>
</div>
</div>
</div>
<div class="taglist"><a href="https://blog.0xhenrique.org/tags.html">Tags</a>: <a href="https://blog.0xhenrique.org/tag-projects.html">projects</a> <a href="https://blog.0xhenrique.org/tag-programming.html">programming</a> <a href="https://blog.0xhenrique.org/tag-clojure.html">clojure</a> <a href="https://blog.0xhenrique.org/tag-lum.html">lum</a> </div></div>
<div id="postamble" class="status"><a href="https://blog.0xhenrique.org/rss.xml">My RSS Feed</a>
<center>Created using GNU Emacs + <a href="https://github.com/bastibe/org-static-blog">Org Static Blog</a>.</center></div>
</body>
</html>
